In [1]:
import numpy as py
import pandas as pd

In [2]:
exports = [10382, 48373, 37273, 47373, 94844, 58473, 84734, 67303]
country = ["Egypt", "Russia", "United State", "United Kingdom", "India", "Sweden", "Dubai", "Japan"]
imports = [45039, 39398, 47274, 20933, 73823, 93723, 12039, 38061]

In [3]:
data_dictionary = {"exports": exports, "country": country, "imports": imports}

In [4]:
data_frame = pd.DataFrame(data_dictionary)
data_frame

   exports         country  imports
0    10382           Egypt    45039
1    48373          Russia    39398
2    37273    United State    47274
3    47373  United Kingdom    20933
4    94844           India    73823
5    58473          Sweden    93723
6    84734           Dubai    12039
7    67303           Japan    38061

In [5]:
data_frame_from_list = pd.DataFrame(list(zip(country, exports, imports)), columns=["country", "exports", "imports"])
data_frame_from_list

          country  exports  imports
0           Egypt    10382    45039
1          Russia    48373    39398
2    United State    37273    47274
3  United Kingdom    47373    20933
4           India    94844    73823
5          Sweden    58473    93723
6           Dubai    84734    12039
7           Japan    67303    38061

In [8]:
importexport_df = pd.read_csv('importexport.csv')
importexport_df

     United States  48329  38233
0           Russia  48373  82323
1            Egypt  34723  12398
2   United Kingdom  47392  61209
3            India  58232  42992
4        Singapore  83422  93823
5            Italy  37434  12938
6            Japan  79345  94623
7         Malaysia  47334  58203
8            Spain  57394  94823
9           France  12934  56843
10         Germany  48334  38573
11          Mexico  53723  72842
12        Columbia  53734  60327

In [9]:
importexport_df.columns

Index(['United States', '48329', '38233'], dtype='object')

In [10]:
importexport_df = pd.read_csv('importexport.csv', header=None)
importexport_df

                 0      1      2
0    United States  48329  38233
1           Russia  48373  82323
2            Egypt  34723  12398
3   United Kingdom  47392  61209
4            India  58232  42992
5        Singapore  83422  93823
6            Italy  37434  12938
7            Japan  79345  94623
8         Malaysia  47334  58203
9            Spain  57394  94823
10          France  12934  56843
11         Germany  48334  38573
12          Mexico  53723  72842
13        Columbia  53734  60327

In [11]:
importexport_df.columns

Index([0, 1, 2], dtype='int64')

In [12]:
importexport_df.columns = ["country","exports","imports"]
importexport_df

           country  exports  imports
0    United States    48329    38233
1           Russia    48373    82323
2            Egypt    34723    12398
3   United Kingdom    47392    61209
4            India    58232    42992
5        Singapore    83422    93823
6            Italy    37434    12938
7            Japan    79345    94623
8         Malaysia    47334    58203
9            Spain    57394    94823
10          France    12934    56843
11         Germany    48334    38573
12          Mexico    53723    72842
13        Columbia    53734    60327

In [13]:
# Index is returned by
importexport_df.index

RangeIndex(start=0, stop=14, step=1)

In [14]:
# Read file and set 1st column as index. 
importexport_df = pd.read_csv('importexport.csv', header=None, index_col=0)
importexport_df

                    1      2
0
United States   48329  38233
Russia          48373  82323
Egypt           34723  12398
United Kingdom  47392  61209
India           58232  42992
Singapore       83422  93823
Italy           37434  12938
Japan           79345  94623
Malaysia        47334  58203
Spain           57394  94823
France          12934  56843
Germany         48334  38573
Mexico          53723  72842
Columbia        53734  60327

In [15]:
importexport_df.columns = ["exports","imports"]
importexport_df

                exports  imports
0
United States     48329    38233
Russia            48373    82323
Egypt             34723    12398
United Kingdom    47392    61209
India             58232    42992
Singapore         83422    93823
Italy             37434    12938
Japan             79345    94623
Malaysia          47334    58203
Spain             57394    94823
France            12934    56843
Germany           48334    38573
Mexico            53723    72842
Columbia          53734    60327

In [16]:
importexport_df.index

Index(['United States', 'Russia', 'Egypt', 'United Kingdom', 'India',
       'Singapore', 'Italy', 'Japan', 'Malaysia', 'Spain', 'France', 'Germany',
       'Mexico', 'Columbia'],
      dtype='object', name=0)

In [19]:
# Renames the index name.
importexport_df.index.name = "country"
importexport_df

                exports  imports
country
United States     48329    38233
Russia            48373    82323
Egypt             34723    12398
United Kingdom    47392    61209
India             58232    42992
Singapore         83422    93823
Italy             37434    12938
Japan             79345    94623
Malaysia          47334    58203
Spain             57394    94823
France            12934    56843
Germany           48334    38573
Mexico            53723    72842
Columbia          53734    60327

In [21]:
# Delete the index name
importexport_df.index.name = None
importexport_df

                exports  imports
United States     48329    38233
Russia            48373    82323
Egypt             34723    12398
United Kingdom    47392    61209
India             58232    42992
Singapore         83422    93823
Italy             37434    12938
Japan             79345    94623
Malaysia          47334    58203
Spain             57394    94823
France            12934    56843
Germany           48334    38573
Mexico            53723    72842
Columbia          53734    60327